(global.webpackJsonp = global.webpackJsonp || []).push([ [ "pages/user-agreement/user-agreement" ], {
    "294f": function(n, e, t) {
        Object.defineProperty(e, "__esModule", {
            value: !0
        }), e.default = void 0;
        var a = {
            data: function() {
                return {
                    data: [ "任何用户在使用表情包图片之前，均应仔细阅读本声明，用户可选择不使用我司提供的服务，一旦使用，即被视为对本声明全部内容的认可和接受", "1、任何通过表情包图片搜索引擎技术和服务所得的搜索结果，以及其它所有内容，均系该图片或视频的所有者制作和提供（以下简称 “ 第三方 ”）。该等搜索结果均系搜索引掌技术自动搜录所得，并不是也不反映本公司之任何意见和主张，也不表示本公司同意或支持该等第三方提供的任何内容、主张或立场。本公司对第三方提供的内容之合法性、准确性、真实性、适用性、安全性等概不负责，也无法负责。若发现任何色情、低俗、暴力、政治、违法等任何令人不适的内容，请通过举报投诉按钮向我们投诉，我们会在一个工作日内审核并屏蔽相关结果。", "2、任何单位或个人如需要第三方提供的内容（包括资讯、资料、消息、产品或服务介绍、报价等），应慎重辨别这些内容的合法性、准确性、真实性、实用性和安全性，并采取谨慎的预防措施。如您不确定这些内容是否合法、准确、真实、实用和安全，本公司建议您先咨询专业人士。", "3、任何单位或者个人因相信、使用第三方内容，或据此进行交易等行为，而引致的人身伤亡、财产毁损（包括因下载而感染病毒）、名誉或商誉诽谤、版权或知识产权等权利的侵犯等事件，及因该等事件所造成的损害后果，本公司概不负责，亦不会也不能承担任何法责任，而应由第三方内容的所有者承担。无论何种原因，本公司不对任何非与本公司直接发生的交易和行为承担任何直接、间接、附带或衍生的损失和责任。", "4、任何第三方内容如不想被本公司的搜索引擎技术收录，须及时向本公司反映，或在其网站的页面中根据拒绝蜘蛛协议（Robots Exclusion Protocol）加注拒绝收录的标记，否则，本公司的搜索引擎技术将视其为可收录网站。", "5、任何单位或个人如认为通过本公司搜索服务所得的第三方内容可能涉嫌侵害其合法著作权，应按照《信息网络传播权保护条例》的规定，以书面的形式及时向本公司反应，并提供相应身份证明、权属证明及详细的侵权情况证明，本公司在收到上述文件后，会尽快清除搜索结果中的侵权内容。本公司提醒您注意：如您的主张侵权或主张不侵权的陈述失实，您将按照《信息网络传播权保护条例》的规定，承担相关法律责任。", "6、用户上传至本应用的相关图片或视频均为其自行提供，用户依法应对此承担全部责任，并保证该图片或视频不会侵犯任何第三方的知识产权或其他合法权益。", "7、如果用户上传的相关图片或视频因侵犯第三人权利而导致本公司被任何第三方投诉、起诉、索赔或者遭到行政处罚，并由此导致本公司需要承担任何责任或损失的，用户保证承担全部责任，并补偿由此给本公司造成的全部损失。", "8、基于互联网的特殊性，本公司对服务的及时性、安全性无法作出担保，也不对用户上传图片或视频的保存、修改、删除或储存失败负责，不承担非因本公司过错所导致的任何责任。" ]
                };
            }
        };
        e.default = a;
    },
    "6b4e": function(n, e, t) {
        (function(n) {
            function e(n) {
                return n && n.__esModule ? n : {
                    default: n
                };
            }
            t("1c42"), e(t("66fd")), n(e(t("6c40")).default);
        }).call(this, t("543d").createPage);
    },
    "6c40": function(n, e, t) {
        t.r(e);
        var a = t("8cde"), u = t("a91a");
        for (var c in u) "default" !== c && function(n) {
            t.d(e, n, function() {
                return u[n];
            });
        }(c);
        t("ac4d");
        var o = t("f0c5"), r = Object(o.a)(u.default, a.b, a.c, !1, null, null, null, !1, a.a, void 0);
        e.default = r.exports;
    },
    "8cde": function(n, e, t) {
        t.d(e, "b", function() {
            return a;
        }), t.d(e, "c", function() {
            return u;
        }), t.d(e, "a", function() {});
        var a = function() {
            var n = this;
            n.$createElement;
            n._self._c;
        }, u = [];
    },
    a91a: function(n, e, t) {
        t.r(e);
        var a = t("294f"), u = t.n(a);
        for (var c in a) "default" !== c && function(n) {
            t.d(e, n, function() {
                return a[n];
            });
        }(c);
        e.default = u.a;
    },
    ac4d: function(n, e, t) {
        var a = t("d7ee");
        t.n(a).a;
    },
    d7ee: function(n, e, t) {}
}, [ [ "6b4e", "common/runtime", "common/vendor" ] ] ]);